app/controllers/surveys_controller.rb

  def index
    @user = User.new
    @survey_texts = SurveyText.where(is_active: true)
---
SELECT "survey_texts".* FROM "survey_texts" WHERE "survey_texts"."is_active" = ?  [["is_active", "t"]]