app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "t@test.com"], ["LIMIT", 1]]
INSERT INTO "users" ("mixpanel_id", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["mixpanel_id", "d7e6f28a015c1438dab11529973a2d8b"], ["email", "t@test.com"], ["created_at", "2018-10-01 03:36:45.326234"], ["updated_at", "2018-10-01 03:36:45.326234"]]
INSERT INTO "surveys" ("user_id", "question_id", "answer1_selected", "answer2_selected", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 22], ["question_id", 1], ["answer1_selected", "f"], ["answer2_selected", "t"], ["created_at", "2018-10-01 04:12:26.896249"], ["updated_at", "2018-10-01 04:12:26.896249"]]
---
  def create
    user = User.where(email: params[:user][:email]).first
    if user.blank?
      user = User.new(user_params)
      user.save
    end

    JSON.parse(params[:survey_params]).each do | survey_param |
      survey = Survey.new(
        user_id: user.id,
        question_id: survey_param["question_id"],
        answer1_selected: survey_param["answer1_selected"],
        answer2_selected: survey_param["answer2_selected"],
        answer3_selected: survey_param["answer3_selected"],
        answer4_selected: survey_param["answer4_selected"],
        answer5_selected: survey_param["answer5_selected"],
        answer6_selected: survey_param["answer6_selected"],
        answer7_selected: survey_param["answer7_selected"],
      )
      survey.save